#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("","Введите название товара!");
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	Сообщить(ТекстСообщения);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
	
КонецФункции

#КонецОбласти
